EDTДоговоры_ПРОФ_демо/src/Reports/Документы/Документы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>Документы</name>
</mdclass:Report>

EDTДоговоры_ПРОФ_демо/src/Catalogs/КатегорииОтчетов/КатегорииОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииОтчетов</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>БезКатегории</name>
      <description>?</description>
    </items>
    <items>
      <name>Администрирование</name>
      <description>Администрирование</description>
    </items>
    <items>
      <name>ПоДокументам</name>
      <description>По документам</description>
    </items>
    <items>
      <name>Статистические</name>
      <description>Статистические</description>
    </items>
  </predefined>
  <attributes>
    <name>ИспользоватьДляКонтекстныхОтчетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDTДоговоры_ПРОФ_демо/src/Reports/Документы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область НастройкиОтчетаПоУмолчанию

Процедура ЗаполнитьСписокКатегорийИРазделовОтчета(КлючВариантаОтчета, СписокКатегорий, СписокРазделов) Экспорт
	
	Если КлючВариантаОтчета = "СписокДокументов"
	 Или КлючВариантаОтчета = "ДокументыСИстекающимСроком" 
	 Или КлючВариантаОтчета = "ДокументыУКонтрагентов" 
	 Или КлючВариантаОтчета = "ДокументыСПросроченнымиЭтапами" Тогда 
	 
	 	СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоДокументам);
		
		СписокРазделов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
			Метаданные.Подсистемы.Настройки));

	ИначеЕсли КлючВариантаОтчета = "АнализЗаключенныхДоговоров" 	 
	  Или КлючВариантаОтчета = "ДинамикаЗаключенныхДоговоров" Тогда 

		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоДокументам);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.Статистические);
		
		СписокРазделов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
			Метаданные.Подсистемы.Настройки));
 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
